package Chapter02_변수;

public class memo {
	
	/*
	 * # 변수의 명명규칙
	 * 1. 대소문자가 구분되며 길이에 제한이 없다
	 * 2. 예약어를 사용해서는 안된다.
	 * 3. 숫자로 시작해서는 안된다
	 * 4. 특수문자는 _ 와 $ 만 허용한다.
	 * 
	 * # 권장규칙
	 * 1. 클래스 이름의 첫 글자는 항상 대문자로 한다.
	 *  - 변수와 메서드의 이름의 첫 글자는 항상 소문자로 한다.
	 * 2. 여러 단어로 이루어진 이름은 단어의 첫 글자를 대문자로 한다.
	 *  - oneTwo
	 * 3. 상수의 이름은 모두 대문자로 한다. 여러 단어로 이루어진 경우 _ 로 구분한다.
	 * 
	 * # 기본형(primitive type)
	 *  - 논리형(boolean), 문자형(char), 정수형(byte, short, int, long), 실수형(float,double)
	 *    계산을 위한 실제 값을 저장한다. 모두 8개
	 * # 참조형(reference type)
	 *  - 객체의 주소를 저장한다. 8개의 기본형을 제외한 나머지 타입   
	 * 
	 *	# 상수와 리터럴(constant & literal)	
	 *	final int MAX_SPEED = 10; // 상수 MAX_SPEED를 선언 & 초기화
	 *			  (상수)		 (리터럴)
	 *
	 *	int year = 2025;
	 *		(변수)  (리터럴)
	 *
	 *	
	 *
	 *
	 * 
	 *
	 * 
	 * 
	 * 
	 */

}
